---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinShapen2
source: html/8e8c5c3c-6b8c-b581-ea3d-c5b5b6b4308b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinShapen2 Property

"Alternating Bar - Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinShapen2 { get; }
```